In [1]:
import pandas as pd
import numpy as np

In [2]:
dfo = pd.read_csv('flights2.csv.gz', low_memory=False)
df = dfo.set_index(['DESTINATION_AIRPORT', 'AIRLINE'])
df = df.sort_index()
df.head()

                             YEAR  MONTH  DAY  DAY_OF_WEEK  FLIGHT_NUMBER  \
DESTINATION_AIRPORT AIRLINE
ABE                 DL       2015      1    4            7           2036
                    DL       2015      1    5            1           1411
                    DL       2015      1    6            2           1411
                    DL       2015      1    7            3           1411
                    DL       2015      1    8            4           1411

                            TAIL_NUMBER ORIGIN_AIRPORT  SCHEDULED_DEPARTURE  \
DESTINATION_AIRPORT AIRLINE
ABE                 DL           N979AT            ATL                 2101
                    DL           N989AT            ATL                 2034
                    DL           N979AT            ATL                 2034
                    DL           N958AT            ATL                 2034
                    DL           N994AT            ATL                 2034

                             DEPARTURE_TIME  DEPARTURE_DELAY  ...  \
DESTINATION_AIRPORT AIRLINE                                   ...
ABE                 DL               2101.0              0.0  ...
                    DL               2032.0             -2.0  ...
                    DL               2032.0             -2.0  ...
                    DL               2031.0             -3.0  ...
                    DL               2030.0             -4.0  ...

                             ARRIVAL_TIME  ARRIVAL_DELAY  DIVERTED  CANCELLED  \
DESTINATION_AIRPORT AIRLINE
ABE                 DL             2252.0            1.0         0          0
                    DL             2227.0            2.0         0          0
                    DL             2221.0           -4.0         0          0
                    DL             2226.0            1.0         0          0
                    DL             2223.0           -2.0         0          0

                             CANCELLATION_REASON  AIR_SYSTEM_DELAY  \
DESTINATION_AIRPORT AIRLINE
ABE                 DL                       NaN               NaN
                    DL                       NaN               NaN
                    DL                       NaN               NaN
                    DL                       NaN               NaN
                    DL                       NaN               NaN

                             SECURITY_DELAY  AIRLINE_DELAY  \
DESTINATION_AIRPORT AIRLINE
ABE                 DL                  NaN            NaN
                    DL                  NaN            NaN
                    DL                  NaN            NaN
                    DL                  NaN            NaN
                    DL                  NaN            NaN

                             LATE_AIRCRAFT_DELAY  WEATHER_DELAY
DESTINATION_AIRPORT AIRLINE
ABE                 DL                       NaN            NaN
                    DL                       NaN            NaN
                    DL                       NaN            NaN
                    DL                       NaN            NaN
                    DL                       NaN            NaN

[5 rows x 29 columns]

## Constructing MultiIndexes

### Using Set Index

In [3]:
df.index

MultiIndex([('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ('ABE', 'DL'),
            ...
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO'),
            ('YUM', 'OO')],
           names=['DESTINATION_AIRPORT', 'AIRLINE'], length=469968)

### From numpy arrays

In [4]:
airlines = dfo.AIRLINE.to_numpy()
dests = dfo.DESTINATION_AIRPORT.to_numpy()

display(airlines, dests)

array(['AS', 'AA', 'US', ..., 'F9', 'F9', 'UA'], dtype=object)

array(['SEA', 'PBI', 'CLT', ..., 'TPA', 'ATL', 'DEN'], dtype=object)

In [5]:
pd.MultiIndex.from_arrays([airlines, dests])

MultiIndex([('AS', 'SEA'),
            ('AA', 'PBI'),
            ('US', 'CLT'),
            ('AA', 'MIA'),
            ('AS', 'ANC'),
            ('DL', 'MSP'),
            ('NK', 'MSP'),
            ('US', 'CLT'),
            ('AA', 'DFW'),
            ('DL', 'ATL'),
            ...
            ('UA', 'SFO'),
            ('B6', 'JFK'),
            ('US', 'MSP'),
            ('B6', 'MCO'),
            ('B6', 'PSE'),
            ('B6', 'BQN'),
            ('DL', 'DTW'),
            ('F9', 'TPA'),
            ('F9', 'ATL'),
            ('UA', 'DEN')],
           length=469968)

### From a list of tuples

In [6]:
tups = [tuple(x) for x in dfo[['DESTINATION_AIRPORT', 'AIRLINE']][:10].to_numpy()]
tups

[('SEA', 'AS'),
 ('PBI', 'AA'),
 ('CLT', 'US'),
 ('MIA', 'AA'),
 ('ANC', 'AS'),
 ('MSP', 'DL'),
 ('MSP', 'NK'),
 ('CLT', 'US'),
 ('DFW', 'AA'),
 ('ATL', 'DL')]

In [7]:
pd.MultiIndex.from_tuples(tups)

MultiIndex([('SEA', 'AS'),
            ('PBI', 'AA'),
            ('CLT', 'US'),
            ('MIA', 'AA'),
            ('ANC', 'AS'),
            ('MSP', 'DL'),
            ('MSP', 'NK'),
            ('CLT', 'US'),
            ('DFW', 'AA'),
            ('ATL', 'DL')],
           )

### Cross product

In [8]:
pd.MultiIndex.from_product([[1, 2, 3], [2000, 2001], ['Sem 1', 'Sem 2']])

MultiIndex([(1, 2000, 'Sem 1'),
            (1, 2000, 'Sem 2'),
            (1, 2001, 'Sem 1'),
            (1, 2001, 'Sem 2'),
            (2, 2000, 'Sem 1'),
            (2, 2000, 'Sem 2'),
            (2, 2001, 'Sem 1'),
            (2, 2001, 'Sem 2'),
            (3, 2000, 'Sem 1'),
            (3, 2000, 'Sem 2'),
            (3, 2001, 'Sem 1'),
            (3, 2001, 'Sem 2')],
           )

### Naming your index

In [9]:
index = pd.MultiIndex.from_product([[1, 2, 3], [2000, 2001], ['Sem 1', 'Sem 2']])
index.names = ['Student', 'Year', 'Sem']
index

MultiIndex([(1, 2000, 'Sem 1'),
            (1, 2000, 'Sem 2'),
            (1, 2001, 'Sem 1'),
            (1, 2001, 'Sem 2'),
            (2, 2000, 'Sem 1'),
            (2, 2000, 'Sem 2'),
            (2, 2001, 'Sem 1'),
            (2, 2001, 'Sem 2'),
            (3, 2000, 'Sem 1'),
            (3, 2000, 'Sem 2'),
            (3, 2001, 'Sem 1'),
            (3, 2001, 'Sem 2')],
           names=['Student', 'Year', 'Sem'])

### MultiIndex columns

In [10]:
data = [[1.1, 40, 0.9, 30], [1.2, 45, 1.05, 40], [1.3, 65, 1.3, 55], [1.5, 80, 1.6, 75]]
columns = pd.MultiIndex.from_product([['Jack', 'Jill'], ['Height', 'Age']])
rows = pd.to_datetime(['2000-01-01', '2001-01-01', '2002-01-01', '2003-01-01'])
df2 = pd.DataFrame(data, columns=columns).set_index(rows)
df2

             Jack       Jill
           Height Age Height Age
2000-01-01    1.1  40   0.90  30
2001-01-01    1.2  45   1.05  40
2002-01-01    1.3  65   1.30  55
2003-01-01    1.5  80   1.60  75

In [11]:
df2['Jack']

            Height  Age
2000-01-01     1.1   40
2001-01-01     1.2   45
2002-01-01     1.3   65
2003-01-01     1.5   80

In [12]:
df2.loc[:, ('Jack', 'Height')]

2000-01-01    1.1
2001-01-01    1.2
2002-01-01    1.3
2003-01-01    1.5
Name: (Jack, Height), dtype: float64

In [13]:
df2[('Jack', 'Height')]

2000-01-01    1.1
2001-01-01    1.2
2002-01-01    1.3
2003-01-01    1.5
Name: (Jack, Height), dtype: float64

In [14]:
idx = pd.IndexSlice
df2.loc[:, idx[:, 'Height']]

             Jack   Jill
           Height Height
2000-01-01    1.1   0.90
2001-01-01    1.2   1.05
2002-01-01    1.3   1.30
2003-01-01    1.5   1.60

In [15]:
df2.loc[:, (slice(None), 'Height')]

             Jack   Jill
           Height Height
2000-01-01    1.1   0.90
2001-01-01    1.2   1.05
2002-01-01    1.3   1.30
2003-01-01    1.5   1.60

In [16]:
df2.xs('Height', level=1, axis=1)

            Jack  Jill
2000-01-01   1.1  0.90
2001-01-01   1.2  1.05
2002-01-01   1.3  1.30
2003-01-01   1.5  1.60

In [17]:
df2.columns.names = ['name', 'info']
df2.columns

MultiIndex([('Jack', 'Height'),
            ('Jack',    'Age'),
            ('Jill', 'Height'),
            ('Jill',    'Age')],
           names=['name', 'info'])

In [18]:
df2.xs('Height', level='info', axis=1)

name        Jack  Jill
2000-01-01   1.1  0.90
2001-01-01   1.2  1.05
2002-01-01   1.3  1.30
2003-01-01   1.5  1.60

In [19]:
df2.iloc[:, df2.columns.get_level_values('info') == 'Height']  # Dont do this. Its silly.

name         Jack   Jill
info       Height Height
2000-01-01    1.1   0.90
2001-01-01    1.2   1.05
2002-01-01    1.3   1.30
2003-01-01    1.5   1.60